'''
설명

프로그래밍 언어에는 += 연산자가 있다.
변수 x, y가 있을 때, x += y 를 하면 x에 저장된 값이 (x+y)로 바뀐다.

당신은 x += y 또는 y += x를 원하는 순서대로, 원하는 만큼 수행하여 x나 y 둘 중 하나 이상에 저장된 값이 N을 초과하게 하려고 한다.
이를 이루기 위한 최소 연산 횟수는 몇 번인지 계산하는 프로그램을 작성하라.

입력

첫번째 줄에 3개의 정수 x, y, N이 공백으로 구분되어 주어진다. (1 <= x, y, <= N <= 1,000,000,000)

출력

x나 y 둘 중 하나 이상에 저장된 값이 N을 초과하게 하기 위해 x+=y 또는 y+=x 연산을 최소 몇 번 수행해야 하는지 출력한다.
'''
x, y, N = map(int, input().split())

count = 0
idx = 1

while x <= N and y <= N:
    count += 1
    if x < y:
        x += y
    else:
        y += x

print(count)