'''
설명

3 6 9 게임은 다음과 같은 규칙을 가지고 있다.

1부터 순서대로 숫자를 말하되, 3, 6, 또는 9가 포함된 숫자는 말을 하지 않고, 박수를 친다.
박수를 칠 때, 3, 6 또는 9가 들어가 있는 개수만큼 박수를 친다.
예를 들어, 35는 1번, 36은 2번을 쳐야 한다.
정수 N이 주어졌을 때, 1~N까지의 숫자를 게임 규칙에 맞게 출력하는 프로그램을 작성하라.

입력

첫번째 줄에 N이 주어진다. (1 <= N <= 1,000)

출력

1부터 N까지의 숫자를 게임 규칙에 맞게 공백으로 구분하여 출력한다.
박수 1번은 '-'로, 박수 2번은 '--'로 출력한다.
'''
N = int(input())

for i in range(1, N + 1):
    counter = 0;
    temp = i

    while temp > 0:
        if temp % 10 in [3, 6, 9]:
            counter += 1
        temp //= 10

    if counter == 0:
        print(i, end=" ")
    else:
        print("-" * counter, end=" ")