'''
설명

자율주행 기차가 운행되고 있다.
이 기차는 1번역부터 4번역까지 총 4개의 정차역이 있는 노선에서 시범운행을 하고 있다.

이 기차는 타고 내리는 사람들을 자동으로 인식할 수 있다.
출발역에서 종착역까지 가는 도중 가장 높은 혼잡도를 계산하려고 한다.
이 기차를 이용하는 사람들은 질서를 잘 지키며, 역에서 내리는 사람들이 모두 내린 후 탑승객들이 탑승한다고 가정하자.

image.png
예를 들어, 위와 같은 경우에 2번역에서 3명의 사람이 내리고, 13명이 사람이 기차에 탔을 때, 총 42명의 사람이 타고 있게 된다.
그리고 이 때가 가장 사람이 많은, 즉, 혼잡도가 높은 상황이다.

이 기차는 다음 조건을 만족한다.

기차는 역 번호 순서대로 운행한다.
출발역에서 내린 사람 수와 종착역에서 탄 사람의 수는 0이다.
각 역에서 현재 기차에 탑승한 인원보다 더 많이 내리는 경우는 없다.
기차의 최대 정원은 10,000명이며, 이를 초과하는 경우는 없다.
4개의 기차역에서 타고 내린 사람들의 정보가 주어졌을 때, 기차에 사람이 가장 많을 때의 사람 수를 계산하는 프로그램을 작성하시오.

입력

4개의 줄에 걸쳐 각 역에서 내린 사람 수와 탄 사람의 수가 공백으로 구분되어 주어진다.

출력

가장 혼잡할 때 기차에 탑승하고 있는 사람의 수를 출력한다.
'''
max = 0
p = 0

for idx in range (1, 5, 1):
    g, o = map(int, input().split())
    p = p - g + o

    if p > max:
        max = p

print(max)