'''
설명

배틀 로얄 게임은 N명의 유저가 경쟁하는 게임이다.
각 유저들은 본인이 소속된 팀 이름과 본인이 획득한 점수를 가지고 있다.

게임의 승패는 팀원들의 합산 점수로 이루어진다.
개개인이 획득한 점수가 높다면, 팀원의 수가 적어도 충분히 승리할 수 있다.

당신과 당신의 친구는 각자 다른 팀으로 게임에 참여하였다.
각 팀원들이 획득한 점수의 합계를 비교하여, 점수가 더 높은 사람이 기분좋게 PC방 비를 내기로 결정하였다.

게임 시작 후 N명의 유저가 배정된 팀 명, 각 팀원들이 획득한 점수, 그리고 당신과 친구의 팀 명이 주어졌을 때,
두 팀의 팀원 수와 획득한 점수, 그리고 두 팀 중 어떤 팀이 더 높은 점수를 얻게 되는지 출력하는 프로그램을 작성하라.

입력

첫번째 줄에 게임에 참가한 유저의 수 N이 주어진다. (2 <= N <= 300,000)
두번째 줄부터 N개의 줄에 걸처 i번 유저가 배정된 팀명과, 해당 유저가 획득한 점수 S가 공백으로 구분되어 주어진다. (1 <= S <= 100)
마지막 줄에는 당신이 배정된 팀과 친구가 배정된 팀명이 공백으로 구분되어 주어진다.
당신과 친구의 팀명은 입력에 반드시 존재하며, 둘은 다른 팀임이 보장된다.
또한, 두 팀의 합산 점수가 동일한 경우의 입력은 주어지지 않음이 보장된다.

출력

첫 번째 줄에 당신이 속한 팀원 수와 팀원의 합산 점수를 공백으로 구분하여 출력한다.
두 번째 줄에 친구가 속한 팀원 수와 팀원의 합산 점수를 공백으로 구분하여 출력한다.
마지막 줄에 당신과 친구 중 점수가 높은 팀 이름을 출력한다.
'''
n = int(input())

board = {}

for repeat in range(n):
    (team, score) = input().split()
    if team not in board:
        board[team] = {"member" : 0, "score" : 0}
    board[team]["score"] += int(score)
    board[team]["member"] += 1

(me, friend) = input().split()

print(board[me]["member"], board[me]["score"])
print(board[friend]["member"], board[friend]["score"])
if (board[me]["score"] > board[friend]["score"]):
    print(me)
else:
    print(friend)
