'''
설명

구형 핸드폰의 천지인 키패드는 다음과 같이 생겼다.


이 키패드로 'gift'라는 단어를 입력하려면, 다음과 같은 순서대로 키패드를 눌러야 한다.

4를 1번 (g)
4를 3번 (i)
3을 3번 (f)
8을 1번 (t)
즉, 4/444/333/8을 눌러야 'gift'가 입력된다.
여기서 중복을 제외하면 4/4/3/8을 입력해야 한다.

중복을 제외한 키패드 입력이 주어졌을 때, N개의 단어 중 몇개를 출력할 수 있는지를 구하는 프로그램을 작성하라.

입력

첫 번째 줄에 N(1 ≤ N ≤ 1,000) 이 주어진다.
두 번째 줄부터 N개의 줄에는 알파벳 소문자로 이루어진 단어가 주어진다.
마지막 줄에는 중복을 제외한 키패드 입력이 주어진다.
숫자열의 길이는 1,000 이하이고, 2 이상 9 이하의 수들로 이루어져 있다.
N개의 알파벳 단어들의 길이의 총합은 1,000,000을 넘지 않는다.

출력

N개의 단어 중 주어진 키패드 입력으로 출력할 수 있는 단어의 개수를 출력한다.
'''
KEYPAD ={
    '2': ['a', 'b', 'c'],
    '3': ['d', 'e', 'f'],
    '4': ['g', 'h', 'i'],
    '5': ['j', 'k', 'l'],
    '6': ['m', 'n', 'o'],
    '7': ['p', 'q', 'r', 's'],
    '8': ['t', 'u', 'v'],
    '9': ['w', 'x', 'y', 'z']
}

N = int(input())
words = []
for _ in range(N):
    words.append(input())

pressed_keys = input()

for idx in range(len(pressed_keys)):
    key = pressed_keys[idx]
    for word in words:
        if word[idx] not in KEYPAD[key]:
            words.remove(word)

print(len(words))