'''
설명

한 쌍의 남녀가 식당에서 소개팅을 하고 있다.

남자와 여자의 외모를 0부터 10까지 멋짐/ 아름다움을 평가한다고 했을 때,

둘 중 하나라도 8점 이상의 외모를 가지고 있다면, 소개팅의 성공률은 매우 높아진다.

하지만 예외로, 둘 중 하나라도 2점 이하의 외모를 가지고 있다면, 소개팅은 절대 성공하지 못할 것이다.

그 외의 경우에는 어떻게 될지 모른다.

남자와 여자의 외모의 점수가 주어졌을 때, 소개팅의 성공 여부를 파악해보자.

입력

첫번째 줄에 남자의 외모 점수와 여자의 외모 점수가 공백으로 주어진다. (0 <= 외모 점수 <= 10)

출력

소개팅이 실패한다고 판단되면 0을 출력한다.
소개팅이 어떻게 될 지 모른다면 1을 출력한다.
소개팅이 성공한다고 판단되면 2를 출력한다.
'''

A, B = map(int, input().split())

if A <= 2 or B <= 2:
    print(0)
elif A >= 8 or B >= 8:
    print(2)
else:
    print(1)