'''
설명

길에서 50km/h 제한인 구역에서 제한 속도보다 빠르게 달린 탓에 경찰에게 속도 위반으로 잡혔다.

벌점은 다음과 같이 주어진다.

만약 속도가 60 이하라면, 주의만 주고 봐준다. (벌점=0)
만약 속도가 61 이상, 80 이하라면, 1 벌점을 준다.
만약 속도가 81 이상이라면, 2 벌점을 준다.
단, 당연히 경찰도 인간적인 면이 있다.
만약 화장실이 너무 급해 사색에 질린 상태라면, 경찰도 벌점 제한 속도에서 5정도는 봐준다.

운전자의 속도와 장의 상태가 주어졌을 때, 운전자에게 주어질 벌점을 책정하라.

입력

첫번째 줄에 운전자가 달리던 속도 S와 상태 T가 공백으로 구분되어 주어진다.(1 <= S <= 200, 0 <= T <= 1)
T는 만약 화장실이 급하다면 1, 아니면 0으로 주어진다.

출력

운전자가 받게 될 벌점을 출력한다.
'''

S, T = map(int, input().split())

if T == 1:
    S -= 5

if S <= 60:
    print(0)
elif S <= 80:
    print(1)
else:
    print(2)