'''
설명

정사각형의 변 길이 n을 입력받고, 문자로 구성된 정사각형을 출력하는 프로그램을 작성하라.

문자가 기입되는 순서는 맨 오른쪽 아래에서부터 위쪽으로 'A' 부터 알파벳이 차례대로 채워나간다.
'Z' 다음부터는 다시 'A'부터 반복한다.
n=4일떄의 문자 사각형의 예시는 다음과 같다.

P L H D 
O K G C 
N J F B 
M I E A 

입력

첫번째 줄에 정사각형의 한 변의 길이 n이 주어진다. (1 <= n <= 100)

출력

주어진 규칙대로 한 변의 길이가 n인 문자 사각형을 출력한다.
각 문자는 공백으로 구분하여 출력한다.
'''
num = int(input())

for i in range(num, 0, -1):
    for j in range(num, 0, -1):
        char_offset = ((j - 1) * num + i - 1) % 26
        print(chr(ord('A') + char_offset), end=' ')
    print()