'''
설명

연구원 지훈이는 고대 도자기 파편의 표면 상태를 관찰하기 위해 가로 100 X 100 크기의 격자판 형태의 디지털 도화지를 준비했습니다.

지훈이는 특수 스캔 마스크(가로 10, 세로 10 크기의 검은색 정사각형 격자)를 도화지 위에 여러 장 올려놓아 특정 손상 부위들을 덮었습니다. 이때, 마스크끼리 서로 겹쳐서 놓일 수 있습니다.

스캔 마스크가 놓인 위치(마스크의 왼쪽 아래 모서리 좌표)들이 주어졌을 때, 마스크에 의해 덮인 검은색 영역 전체의 넓이를 구하는 프로그램을 작성해 주세요. (중복되어 덮인 영역은 한 번만 계산합니다.)


입력

첫째 줄에 스캔 마스크(색종이)의 개수 N이 주어집니다. (1 <= N <= 100)
둘째 줄부터 N개의 줄에 걸쳐 각 마스크를 붙인 위치가 두 개의 자연수로 주어집니다.
첫 번째 숫자는 마스크의 왼쪽 변과 도화지의 왼쪽 변 사이의 거리이며, 두 번째 숫자는 마스크의 아래쪽 변과 도화지의 아래쪽 변 사이의 거리입니다.
마스크가 도화지 밖으로 나가는 경우는 없습니다.
출력

첫째 줄에 마스크가 덮고 있는 검은색 영역의 총 넓이를 출력합니다.
'''
TS = 100 # 테이블 사이즈

N = int(input())

masks = []

for i in range(N):
    row = list(map(int, input().split()))
    masks.append(row)

count = 0
for x in range(TS):
    for y in range(TS):
        for mask in masks:
            if x >= mask[0] and x < mask[0] + 10 and y >= mask[1] and y < mask[1] + 10:
                count += 1
                break

print(count)
