'''
설명

베이커리 기기 전문 회사에서 반죽부터 오븐까지 자동으로 진행되는 스마트 제빵기를 개발했습니다.
재료를 넣으면 현재 시각과 빵이 완성되기까지 걸리는 총 시간(분)을 계산하여 빵이 구워져 나오는 시각을 표시해 줍니다.

현재 시각(시, 분)과 필요한 제빵 시간(분)이 주어질 때, 빵이 완성되는 시각을 구하는 프로그램을 작성하시오.
(단, 시는 0부터 23까지, 분은 0부터 59까지의 정수로 표현하며, 23시 59분 다음은 0시 0분입니다.)

입력

첫번째 줄에 현지 시각 H시와 M분이 공백으로 구분되어 입력됩니다. (0 <= H <= 23, 0 <= M <= 59)
두번째 줄에 빵이 완성되기까지 필요한 시간 T가 주어진다. (0 <= T <= 1000)
출력

빵이 완성되는 시간을 출력합니다.
'''

H, M = map(int, input().split())
T = int(input())

MM = (T + M) % 60
HH = (H + ((T + M) // 60)) % 24

print(HH, MM)