'''
설명

주어진 N개의 정수들 중, 입력 받은 수 M과 약수와 배수의 합을 구하는 프로그램을 작성하시오.

예를 들어,
N=6개의 정수 2, 3, 5, 12, 18, 24가 주어지고 M=12라면,

12의 약수 : 2, 3, 12 = 17
12의 배수 : 12, 24 = 36
입력

첫번째 줄에 정수의 개수 N을 입력받는다. (1 <= N <= 40)
두번째 줄에 N개의 정수가 공백으로 구분되어 입력된다.
세번째 줄에는 약수와 배수를 구할 정수 M이 주어진다. (1 <= M <= 100)

출력

첫번째 줄에는 M의 약수들의 합을 출력한다.
두번째 줄에는 M의 배수들의 합을 출력한다.
'''
n = int(input())
data = list(map(int, input().split()))
M = int(input())

sum_d = 0
sum_m = 0

for num in data:
    if M % num == 0:
        sum_d += num
    if num % M == 0:
        sum_m += num

print(sum_d)
print(sum_m)